---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightDistribution
source: html/39162cb5-d13b-c7fa-9297-9a70c5678ac6.htm
---
# Autodesk.Revit.DB.Lighting.LightDistribution

This class is the base class for specifying light distribution.

## Syntax (C#)
```csharp
public class LightDistribution : IDisposable
```